    module Define_Variables
    !用来存储主程序和子程序中用到的变量以及数组
        implicit double precision(A_Matrix-h,o-z)   
        !-------------------------------------------------------------------------------
        real::time_begin,time_end!用来计算程序运行时间的变量
        !-------------------------------------------------------------------------------
        integer::X_max,Y_max,Z_max,C_MAX,Num_Block!记录网格文件中三个方向上网格节点数的最大值、以及分区数
        !-------------------------------------------------------------------------------
        allocatable::Area(:,:,:,:),quality(:,:,:,:),area_1(:,:,:,:)!计算网格质量时用到的数组变量
        !-------------------------------------------------------------------------------
        allocatable :: num(:,:),number(:,:)
        !-------------------------------------------------------------------------------
        allocatable::Points_Position_initial(:,:,:,:,:)!用来记录程序中读到的最开始的网格节点
        allocatable::Wall_Points_Rotate(:,:,:,:,:)!用来记录物面边界旋转之后的节点坐标
        allocatable::Wall_Points_Position(:,:,:,:,:)!用来记录物面边界初始的节点
        !-------------------------------------------------------------------------------
        allocatable::Edge_distance(:,:,:,:,:)!Geometry中用来统计网格边长的数组变量
        !-------------------------------------------------------------------------------
        allocatable::coefficient(:,:,:,:,:)!TFI方法中α和β参数的值
        !-------------------------------------------------------------------------------
        allocatable::Wall_Points_Number(:,:)!用来记录Wall边界上的网格点数,用于节点旋转的循环中
        allocatable::BC_Temp(:),BC_Type(:,:)
        !-------------------------------------------------------------------------------
        allocatable::Points_Position_RBF(:,:)!RBF插值
        allocatable::kpoint_RBF(:,:)
        !-------------------------------------------------------------------------------
        real::area_min=10.0
        real::area_max=0.0
        real::ave_quality_ini=0.0
        real::ave_quality_new=0.0
        real::sum=0
        real::Qe=90
        real::pi=acos(-1.0)
        real::maxquality=0.5
        !-------------------------------------------------------------------------------
        real::alpha!rotate_trans中的变量
        real::Alpha_Center!旋转中心与左下角的点的夹角
        !-------------------------------------------------------------------------------
        integer::Edge_Count!用来记录网格文件中物面边界的数量
        !-------------------------------------------------------------------------------
        real::X_Min=10000
        real::Y_Min=10000
        !-------------------------------------------------------------------------------
        real::Read_Boundary_Condition_Time,Count_Max_Time,Cal_WallNumber_Time,Grid_Quality_Time
        !-------------------------------------------------------------------------------
    end module